Multicase_Optimization/Forward/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0.0015;

boundaryField
{
    "(blade|spinner)"
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0.0015;
    }
    "(inlet|outlet|outer|inout)"
    {
        type            calculated;
        value           uniform 0.0015;
    }
    "cyc.*"
    {
        type            cyclic;
    }
}


// ************************************************************************* //